Дошкольное_учреждение83/src/InformationRegisters/удуНеотправленныеИсхДокументы/удуНеотправленныеИсхДокументы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>удуНеотправленныеИсхДокументы</name>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>CatalogRef.ИсходящиеДокументы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Корреспонденты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Адресат</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Отправить</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДоставки</name>
    <type>
      <types>CatalogRef.СпособыДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОтправкаДокумента</name>
    <type>
      <types>CatalogRef.удуОтправкаДокумента</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Дошкольное_учреждение83/src/InformationRegisters/удуДокументыКОтправке/удуДокументыКОтправке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>удуДокументыКОтправке</name>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>CatalogRef.ИсходящиеДокументы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Корреспонденты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Адресат</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДоставки</name>
    <type>
      <types>CatalogRef.СпособыДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОтправкаДокумента</name>
    <type>
      <types>CatalogRef.удуОтправкаДокумента</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Дошкольное_учреждение83/src/InformationRegisters/удуНеотправленныеИсхДокументы/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ВыделитьДокументыКОтправке(Знач СписокДокументов)
	
	Для Инд = 0 По СписокДокументов.Количество() - 1 Цикл
		Запись = РегистрыСведений.удуДокументыКОтправке.СоздатьМенеджерЗаписи();
		Запись.Документ = СписокДокументов[Инд].Документ;
		Запись.Получатель = СписокДокументов[Инд].Получатель;
		Запись.Адресат = СписокДокументов[Инд].Адресат;
		Запись.ВидДоставки = СписокДокументов[Инд].ВидДоставки;
		Запись.ОтправкаДокумента = СписокДокументов[Инд].ОтправкаДокумента;
		Запись.Записать();
		
	КонецЦикла;
КонецПроцедуры // ВыделитьДокументыКОтправке

&НаКлиенте
Процедура Отправка(Команда)
	Данные = Элементы.Список.ВыделенныеСтроки;
	ВыделитьДокументыКОтправке(Данные);
	Если Данные.Количество() > 0 Тогда
 		Результат = ОткрытьФормуМодально("ОбщаяФорма.удуОтправкаСпискаДокументов");
		Элементы.Список.Обновить();
	Иначе	
		Вопрос("Необходимо выбрать документы к отправке",РежимДиалогаВопрос.ОК);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьПривилегированныйРежим(Истина);
	Если Константы.удуИспользоватьРеестрыОтправки.Получить() Тогда 
		Элементы.Сформировать.Видимость = Истина;
	Иначе
		Элементы.Сформировать.Видимость = Ложь;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАдресТекущегоКорреспондента(ТекКор)
	КорреспондентОбъект = ТекКор.ПолучитьОбъект();
	Для Каждого Элем Из КорреспондентОбъект.КонтактнаяИнформация Цикл
		Если Элем.Вид = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресКорреспондента Тогда
			ПочтовыйАдрес = Элем.Представление;
		ИначеЕсли Элем.Вид = Справочники.ВидыКонтактнойИнформации.ФактическийАдресКорреспондента Тогда
			ФактическийАдрес = Элем.Представление;
		ИначеЕсли Элем.Вид = Справочники.ВидыКонтактнойИнформации.ЮридическийАдресКорреспондента Тогда
		    ЮридическийАдрес = Элем.Представление;
		КонецЕсли;
	КонецЦикла;
	Адрес = "";
	Если ЗначениеЗаполнено(ПочтовыйАдрес) Тогда
		Адрес = ПочтовыйАдрес;
	ИначеЕсли ЗначениеЗаполнено(ФактическийАдрес) Тогда
		Адрес = ФактическийАдрес;
	ИначеЕсли ЗначениеЗаполнено(ЮридическийАдрес) Тогда
		Адрес = ЮридическийАдрес;
	КонецЕсли;
КонецПроцедуры // ЗаполнитьАдресТекущегоКорреспондента 


&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	Если Элементы.Список.ВыделенныеСтроки.Количество() Тогда  
		ТекКорреспондент = Элементы.Список.ТекущиеДанные;
		Если ЗначениеЗаполнено(ТекКорреспондент.Получатель) Тогда
			ЗаполнитьАдресТекущегоКорреспондента(ТекКорреспондент.Получатель);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
